app/controllers/account_exchanges_controller.rb

  def index
    @account_exchanges=current_user.account_exchanges.paginate(page: params[:page])
---
SELECT COUNT(*) FROM "account_exchanges" WHERE "account_exchanges"."user_id" = ?  [["user_id", 1]]

  def create
    @accounts=current_user.accounts
    @account_exchange=current_user.account_exchanges.build(account_exchange_params)
    if @account_exchange.bname==@account_exchange.aname
      flash.now[:danger]="振替元と振替先を変えてください"
      render "new"
    else
      if @account_exchange.save
        before=Account.find_by(:user_id => current_user.id, :name => @account_exchange.bname)
        after=Account.find_by(:user_id => current_user.id, :name => @account_exchange.aname)
        before_value=before.value-@account_exchange.value
        after_value=after.value+@account_exchange.value
        before.update(value: before_value)
---
INSERT INTO "account_exchanges" ("bname", "aname", "value", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["bname", "銀行"], ["aname", "現金"], ["value", 1000], ["date", "2020-06-30"], ["user_id", 1], ["created_at", "2020-06-30 06:41:42.886509"], ["updated_at", "2020-06-30 06:41:42.886509"]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "現金"], ["LIMIT", 1]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 99000], ["updated_at", "2020-06-30 06:41:42.897397"], ["id", 3]]

  def destroy
    a=AccountExchange.find_by(:user_id => params[:user_id], :id => params[:id])
    before=Account.find_by(:user_id => current_user.id, :name => a.bname)
    after=Account.find_by(:user_id => current_user.id, :name => a.aname)
    if before
      before_value=before.value+a.value
      before.update(value: before_value)
    end
    if after
      after_value=after.value-a.value
      after.update(value: after_value)
    end
    a.destroy
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "現金"], ["LIMIT", 1]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 90000], ["updated_at", "2020-06-30 07:12:06.124980"], ["id", 3]]
DELETE FROM "account_exchanges" WHERE "account_exchanges"."id" = ?  [["id", 1]]

  def update
    # ----------------------------------------------------
    @accounts=current_user.accounts
    @account_exchange=AccountExchange.find_by(:user_id => params[:user_id], :id => params[:id])
    @anames=[]
    @bnames=[]
    @accounts.each do |account|
      name=["#{account.name}","#{account.name}"]
      @anames.push(name)
      @bnames.push(name)
    end

    if Account.find_by(:user_id => params[:user_id], :name => @account_exchange.bname)
      @bnames.delete(["#{@account_exchange.bname}","#{@account_exchange.bname}"])
---
DELETE FROM "account_exchanges" WHERE "account_exchanges"."id" = ?  [["id", 25]]

      flash.now[:danger]="振替元と振替先を変えてください"
      render "edit"
    else
      if @account_exchange.update(account_exchange_params)
---
UPDATE "account_exchanges" SET "bname" = ?, "aname" = ?, "value" = ?, "updated_at" = ? WHERE "account_exchanges"."id" = ?  [["bname", "a"], ["aname", "v"], ["value", 50], ["updated_at", "2020-06-30 16:05:43.976201"], ["id", 27]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 409100], ["updated_at", "2020-06-30 14:43:38.933083"], ["id", 3]]

          after.update(value: after_value)
          before=Account.find_by(:user_id => current_user.id, :name => @account_exchange.bname)
          after=Account.find_by(:user_id => current_user.id, :name => @account_exchange.aname)
          before_value=before.value-@account_exchange.value
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "a"], ["LIMIT", 1]]