app/controllers/account_exchanges_controller.rb

DELETE FROM "account_exchanges" WHERE "account_exchanges"."id" = ?  [["id", 18]]
---
  def create
    form_class
    new_variable

    @account_exchange=current_user.account_exchanges.build(account_exchange_params)
    if @account_exchange.bname==@account_exchange.aname
      flash.now[:danger]="振替元と振替先を変えてください"
      render "new" and return
    else
      if @account_exchange.save
        before_account=Account.find_by(:user_id => current_user.id, :name => @account_exchange.bname)
        before_credit=Credit.find_by(:user_id => current_user.id, :name => @account_exchange.bname)
        after=Account.find_by(:user_id => current_user.id, :name => @account_exchange.aname)
        if before_account
          @account_exchange.update(pon: true)
          before_value=before_account.value-@account_exchange.value
          before_account.update(value: before_value)
        else before_credit
          if Account.find_by(:user_id => current_user.id, :name => before_credit.account)
            a=f_pay_date(@account_exchange.date, before_credit)
            @account_exchange.update(pon: false, pay_date: a)
          else
            flash.now[:danger]="選択したクレジットカードと連携しているアカウント(銀行など)が削除されています"
            @account_exchange.destroy

SELECT  "account_exchanges".* FROM "account_exchanges" WHERE "account_exchanges"."user_id" = ? AND "account_exchanges"."id" = ? ORDER BY "account_exchanges"."date" DESC LIMIT ?  [["user_id", 1], ["id", 7], ["LIMIT", 1]]
---
  def update
    form_class
    edit_variable

    before_change_action

    a=current_user.account_exchanges.build(account_exchange_update_params)
    before_credit=Credit.find_by(:user_id => current_user.id, :name => a.bname)