app/controllers/accounts_controller.rb

  def index
    form_class
    @total=0

    @accounts=current_user.accounts
    @events=current_user.events
    @genres=current_user.genres

    @events.each do |event|
      if event.pon==false
        if Date.today>=event.pay_date
          credit=Credit.find_by(:user_id => current_user.id, :name => event.account)
          c_account=Account.find_by(:user_id => current_user.id, :name => credit.account)
          event.update(pon: true)
          c_account.update(value: c_account.value-event.value)
---
SELECT  "credits".* FROM "credits" WHERE "credits"."user_id" = ? AND "credits"."name" = ? LIMIT ?  [["user_id", 1], ["name", "amex"], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? ORDER BY "events"."date" DESC  [["user_id", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."user_id" = ?  [["user_id", 1]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 20900], ["updated_at", "2020-09-05 06:43:16.121270"], ["id", 2]]
UPDATE "events" SET "pon" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["pon", "t"], ["updated_at", "2020-09-05 06:38:15.922836"], ["id", 36]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "銀行"], ["LIMIT", 1]]

  def create
    form_class
    @account=current_user.accounts.build(accounts_params)
    if @account.save
---
INSERT INTO "accounts" ("name", "value", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "現金"], ["value", 1000], ["user_id", 1], ["created_at", "2020-06-28 15:12:56.095079"], ["updated_at", "2020-06-28 15:12:56.095079"]]

  def destroy
    form_class
    Account.find_by(:user_id => params[:user_id], :id => params[:id]).destroy
---
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]