app/controllers/credits_controller.rb

  def create
    form_class
    new_variable

    @credit=current_user.credits.build(credits_params)
    if @credit.pay_date==@credit.month_date
      flash[:danger]="締め日と引き落とし日を別日にしてください"
      render "new"
      return
    elsif Account.find_by(:user_id => params[:user_id], :name => @credit.name)
      flash[:danger]="同名のアカウントがあるためクレジットカードの名前を変えてください"
      render "new"
      return
    else
      if @credit.save
---
INSERT INTO "credits" ("name", "pay_date", "month_date", "account", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "acvb"], ["pay_date", 4], ["month_date", 5], ["account", "銀行"], ["user_id", 1], ["created_at", "2020-09-03 13:40:19.830007"], ["updated_at", "2020-09-03 13:40:19.830007"]]

  def destroy
    form_class
    @credit=Credit.find_by(:user_id => params[:user_id], :id => params[:id])
    a=true
    current_user.events.each do |event|
      if event.pon==false
        if event.account==@credit.name
          a=false
          break
        end
      end
    end
    current_user.account_exchanges.each do |event|
      if event.pon==false
        if event.bname==@credit.name
          a=false
          break
        end
      end
    end
    if a
      @credit.destroy
---
SELECT  "credits".* FROM "credits" WHERE "credits"."user_id" = ? AND "credits"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "credits" WHERE "credits"."id" = ?  [["id", 2]]