app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? ORDER BY "events"."date" DESC LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def update1
    form_class
    edit_variable

    before_change_action

    a=current_user.events.build(events_params_update1)
    credit=Credit.find_by(:user_id => current_user.id, :name => a.account)