app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---
  def index
    form_class
    # 変数定義
    @events=current_user.events.paginate(page: params[:page])

INSERT INTO "events" ("date", "genre", "value", "account", "memo", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 1000], ["updated_at", "2020-08-17 06:39:24.599618"], ["id", 1]]
UPDATE "events" SET "updated_at" = ?, "pay_date" = ?, "pon" = ? WHERE "events"."id" = ?  [["updated_at", "2020-09-05 02:40:04.594918"], ["pay_date", 27], ["pon", "f"], ["id", 35]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "現金"], ["LIMIT", 1]]
SELECT  "credits".* FROM "credits" WHERE "credits"."user_id" = ? AND "credits"."name" = ? LIMIT ?  [["user_id", 1], ["name", "yahoo"], ["LIMIT", 1]]
---
  def create1
    form_class
    new_variable

    @event=current_user.events.build(events_params)
    if @event.save
      @event.update(iae: false)
      account=Account.find_by(:user_id => current_user.id, :name => @event.account)
      if account
        @event.update(pay_date: @event.date, pon: true)
        account.update(value: account.value-@event.value)
      else
        credit=Credit.find_by(:user_id => current_user.id, :name => @event.account)

INSERT INTO "events" ("date", "genre", "value", "account", "memo", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "a"], ["LIMIT", 1]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 2000], ["updated_at", "2020-08-17 06:42:03.129301"], ["id", 1]]
UPDATE "events" SET "iae" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["iae", "t"], ["updated_at", "2020-08-17 06:42:03.123128"], ["id", 2]]
---
  def create2
    form_class
    new_variable

    @event=current_user.events.build(events_params)
    if @event.save
      @event.update(iae: true, pon: true)
      account=Account.find_by(:user_id => current_user.id, :name => @event.account)
      account.update(value: account.value+@event.value)

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "現金"], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? ORDER BY "events"."date" DESC LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 1000], ["updated_at", "2020-08-17 07:05:41.780622"], ["id", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]
---
  def destroy
    form_class
    @event=Event.find_by(:user_id => params[:user_id], :id => params[:id])
    account=Account.find_by(:user_id => params[:user_id], :name => @event.account)
    if account
      if @event.iae==false
        account.update(value: account.value+@event.value)
      else
        account.update(value: account.value-@event.value)
      end
    end
    @event.destroy

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "現金"], ["LIMIT", 1]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", 7000], ["updated_at", "2020-08-20 07:59:32.901216"], ["id", 1]]
UPDATE "events" SET "genre" = ?, "value" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["genre", "生活用品"], ["value", 1000], ["updated_at", "2020-08-20 07:59:32.906568"], ["id", 3]]
SELECT  "credits".* FROM "credits" WHERE "credits"."user_id" = ? AND "credits"."name" = ? LIMIT ?  [["user_id", 1], ["name", "yahoo"], ["LIMIT", 1]]
---
  def update1
    form_class
    edit_variable

    account=Account.find_by(:user_id => current_user.id, :name => @event.account)
    if account
      if @event.iae==false
        account.update(value: account.value+@event.value)
      else
        account.update(value: account.value-@event.value)
      end
    end
    if @event.update(events_params_update1)
      @event.update(iae: false)
      account=Account.find_by(:user_id => current_user.id, :name => @event.account)
      if account
        @event.update(pay_date: @event.date, pon: true)
        account.update(value: account.value-@event.value)
      else
        credit=Credit.find_by(:user_id => current_user.id, :name => @event.account)

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."name" = ? ORDER BY "accounts"."value" DESC LIMIT ?  [["user_id", 1], ["name", "銀行"], ["LIMIT", 1]]
UPDATE "accounts" SET "value" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["value", -2000], ["updated_at", "2020-08-20 08:00:00.559263"], ["id", 2]]
UPDATE "events" SET "value" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["value", 20000], ["updated_at", "2020-08-20 08:00:00.563408"], ["id", 8]]
---
  def update2
    form_class
    edit_variable

    account=Account.find_by(:user_id => current_user.id, :name => @event.account)
    if account
      if @event.iae==false
        account.update(value: account.value+@event.value)