app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."user_id" = ?  [["user_id", 1]]
---
  def index
    @genres=current_user.genres
    @expences=[]
    @incomes=[]
    @genres.each do |genre|

INSERT INTO "genres" ("name", "user_id", "created_at", "updated_at", "iae") VALUES (?, ?, ?, ?, ?)  [["name", "食品"], ["user_id", 1], ["created_at", "2020-07-02 02:56:10.341603"], ["updated_at", "2020-07-02 02:56:10.341603"], ["iae", "f"]]
---
  def create
    @genre=current_user.genres.build(genres_params)
    if @genre.save

DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 3]]
SELECT  "genres".* FROM "genres" WHERE "genres"."user_id" = ? AND "genres"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def destroy
    @genre=Genre.find_by(:user_id => params[:user_id], :id => params[:id]).destroy

SELECT  "genres".* FROM "genres" WHERE "genres"."user_id" = ? AND "genres"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @genre=Genre.find_by(:user_id => params[:user_id], :id => params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."user_id" = ? AND "genres"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "食ryou品"], ["updated_at", "2020-07-02 02:22:34.685485"], ["id", 1]]
---
  def update
    @genre=Genre.find_by(:user_id => params[:user_id], :id => params[:id])
    if @genre.update(genres_params)

SELECT  "genres".* FROM "genres" WHERE "genres"."user_id" = ? AND "genres"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @genre=Genre.find_by(:user_id => params[:user_id], :id => params[:id])